/*Nagorniy Nikolay

lesson 6
В одном tack.cpp файле / проекте:1


    1.)Выделить в памяти динамический одномерный массив типа int. Размер массива запросить у пользователя. Инициализировать
    его числами степенями двойки: 1, 2, 4, 8, 16, 32, 64, 128 ...
    Вывести массив на экран. Не забыть освободить память. =)
    Разбить программу на функции.

    2).Динамически выделить матрицу 4х4 типа int. Инициализировать е
    е псевдослучайными числами через функцию rand. Вывести на экран.
    Разбейте вашу программу на функции которые вызываются из main.

    3).Написать программу, которая создаст два текстовых файла (*.txt),
    примерно по 50-100 символов в каждом (особого значения не имеет с каким именно содержимым).
    Имена файлов запросить у польлзователя.

    4).* Написать функцию, «склеивающую» эти файлы в третий текстовый файл (имя файлов спросить у пользователя).

    5).* Написать программу, которая проверяет присутствует ли указанное пользователем
    при запуске программы слово в указанном пользователем файле
    (для простоты работаем только с латиницей).
    Используем функцию find которая есть в строках std::string.



*/

#include <iostream>
#include <fstream>

void task1();

void task2();

void task3();

void task4();

void task5();

std::string file_name_first,file_name_twice;

int main() {

//    task1();
//    task2();
//    task3();
//    task4();
    task5();

    return 0;
}




void task1() {


}

void task2() {

};


void task3() {


}

void task4() {


}


void task5() {


}