/*Nagorniy Nikolay

lesson 5
В одном tack.cpp файле / проекте:1


    1.Написать программу, проверяющую что сумма двух (введенных с клавиатуры)
    чисел лежит в пределах от 10 до 20 (включительно),
    если да – вывести строку "true", в противном случае – "false";



*/

#include <iostream>
#include <vector>


void task1();


int main() {

    task1();

    return 0;
}

void task1() {

        std::cout << "False " << std::endl;

}

